In [1]:
import pandas as pd
import numpy as np
import os

desired_occupation = "Computer programmers"
state_of_residence = "NY"

In [2]:
occupation_data = pd.read_csv("occupation_data.csv")
university_data = pd.read_csv("university_data.csv")

In [3]:
occupation_data.head()

                                     OccupationTitle MedianWeeklySalary
0            Total full-time wage and salary workers                886
1    Management professional and related occupations               1246
2  Management business and financial operations o...               1355
3                             Management occupations               1429
4                                   Chief executives               2291

In [4]:
university_data.head()

                           UniversityName       City State  OutCost  InCost
0                    Princeton University  Princeton    NJ    51870   51870
1                     ​Harvard University  Cambridge    MA    51925   51925
2                    ​Columbia University   New York    NY    61850    6850
3  ​Massachusetts Institute of Technology  Cambridge    MA    53790   53790
4                        ​Yale University  New Haven    CT    55500   55500

In [5]:
idx = occupation_data["OccupationTitle"] == desired_occupation
weekly = occupation_data[idx]

weekly.head()

         OccupationTitle MedianWeeklySalary
68  Computer programmers               1591

In [15]:
yearly = weekly["MedianWeeklySalary"].astype(int)*52
monthly_contribution = (yearly.array[0]/12)*.1
print(monthly_contribution)

689.4333333333334

In [ ]:
#brute force! sim the months till balance is 0
def sim_payoff(tuit, mon_con):
    total_tuit = tuit*4;
    total_months = 0
    while total_tuit > 0:
        total_tuit += total_tuit * (.0481)/12
        total_tuit -= mon_con
        total_months += 1
    return total_months